docs/benchmarks/raw/2026-07-26-k6-v1-v2-v4.txt
################ v1 ################

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * v1_race: 200 iterations shared among 100 VUs (maxDuration: 30s, exec: v1Test, gracefulStop: 30s)

time="2026-07-26T13:40:38+09:00" level=info msg="[setup] v1 wallet=47 (10,000원)" source=console
time="2026-07-26T13:40:39+09:00" level=info msg="\n========== [v1 비관적락] 정합성 검증 ==========" source=console
time="2026-07-26T13:40:39+09:00" level=info msg="최종 잔액: 0원   기대: 0원 이상" source=console
time="2026-07-26T13:40:39+09:00" level=info msg="  ✓ PASS" source=console
time="2026-07-26T13:40:39+09:00" level=info msg="=================================================" source=console


  █ TOTAL RESULTS 

    checks_total.......: 200     261.172845/s
    checks_succeeded...: 100.00% 200 out of 200
    checks_failed......: 0.00%   0 out of 200

    ✓ [v1] 허용된 응답

    CUSTOM
    v1_insufficient_400............: 100    130.586423/s
    v1_success.....................: 100    130.586423/s

    HTTP
    http_req_duration..............: avg=340.42ms min=2.92ms med=289.41ms max=727.86ms p(90)=625.05ms p(95)=656.5ms 
      { expected_response:true }...: avg=570.5ms  min=3.29ms med=610.14ms max=727.86ms p(90)=656.09ms p(95)=679.79ms
    http_req_failed................: 49.26% 100 out of 203
    http_reqs......................: 203    265.090438/s

    EXECUTION
    iteration_duration.............: avg=348.18ms min=3.14ms med=322.62ms max=728.44ms p(90)=642.91ms p(95)=664.34ms
    iterations.....................: 200    261.172845/s

    NETWORK
    data_received..................: 870 kB 1.1 MB/s
    data_sent......................: 33 kB  43 kB/s



running (0m00.8s), 000/100 VUs, 200 complete and 0 interrupted iterations
v1_race ✓ [ 100% ] 100 VUs  00.7s/30s  200/200 shared iters
################ v2 ################

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * v2_race: 200 iterations shared among 100 VUs (maxDuration: 30s, exec: v2Test, gracefulStop: 30s)

time="2026-07-26T13:40:39+09:00" level=info msg="[setup] v2 wallet=48 (10,000원)" source=console
time="2026-07-26T13:40:40+09:00" level=info msg="\n========== [v2 낙관적락] 정합성 검증 ==========" source=console
time="2026-07-26T13:40:40+09:00" level=info msg="최종 잔액: 1800원   기대: 0원 이상" source=console
time="2026-07-26T13:40:40+09:00" level=info msg="  ✓ PASS" source=console
time="2026-07-26T13:40:40+09:00" level=info msg="=================================================" source=console


  █ TOTAL RESULTS 

    checks_total.......: 200     246.11665/s
    checks_succeeded...: 100.00% 200 out of 200
    checks_failed......: 0.00%   0 out of 200

    ✓ [v2] 허용된 응답

    CUSTOM
    v2_conflict_409................: 118    145.208823/s
    v2_success.....................: 82     100.907826/s

    HTTP
    http_req_duration..............: avg=283.63ms min=2.1ms med=346.79ms max=469.94ms p(90)=400.26ms p(95)=409.85ms
      { expected_response:true }...: avg=168.65ms min=2.1ms med=139.46ms max=443.57ms p(90)=370.03ms p(95)=391.66ms
    http_req_failed................: 58.12% 118 out of 203
    http_reqs......................: 203    249.8084/s

    EXECUTION
    iteration_duration.............: avg=289.96ms min=9.5ms med=347.64ms max=471.11ms p(90)=404.75ms p(95)=416.47ms
    iterations.....................: 200    246.11665/s

    NETWORK
    data_received..................: 594 kB 730 kB/s
    data_sent......................: 33 kB  41 kB/s



running (0m00.8s), 000/100 VUs, 200 complete and 0 interrupted iterations
v2_race ✓ [ 100% ] 100 VUs  00.8s/30s  200/200 shared iters
################ v4 ################

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * v4_race: 200 iterations shared among 100 VUs (maxDuration: 30s, exec: v4Test, gracefulStop: 30s)

time="2026-07-26T13:40:40+09:00" level=info msg="[setup] v4 wallet=49 (10,000원)" source=console

running (0m01.0s), 100/100 VUs, 91 complete and 0 interrupted iterations
v4_race   [  46% ] 100 VUs  01.0s/30s  091/200 shared iters
time="2026-07-26T13:40:42+09:00" level=info msg="\n========== [v4 Redis분산락] 정합성 검증 ==========" source=console
time="2026-07-26T13:40:42+09:00" level=info msg="최종 잔액: 0원   기대: 0원 이상" source=console
time="2026-07-26T13:40:42+09:00" level=info msg="  ✓ PASS" source=console
time="2026-07-26T13:40:42+09:00" level=info msg="===================================================" source=console


  █ TOTAL RESULTS 

    checks_total.......: 200     141.974077/s
    checks_succeeded...: 100.00% 200 out of 200
    checks_failed......: 0.00%   0 out of 200

    ✓ [v4] 허용된 응답

    CUSTOM
    v4_insufficient_400............: 100    70.987038/s
    v4_success.....................: 100    70.987038/s

    HTTP
    http_req_duration..............: avg=586.96ms min=3.32ms med=604.78ms max=1.33s p(90)=940.94ms p(95)=978.59ms
      { expected_response:true }...: avg=500.96ms min=3.32ms med=499.63ms max=1.02s p(90)=923.67ms p(95)=973.72ms
    http_req_failed................: 49.26% 100 out of 203
    http_reqs......................: 203    144.103688/s

    EXECUTION
    iteration_duration.............: avg=603.86ms min=4.46ms med=613.28ms max=1.33s p(90)=942.73ms p(95)=984.67ms
    iterations.....................: 200    141.974077/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 870 kB 617 kB/s
    data_sent......................: 33 kB  23 kB/s



running (0m01.4s), 000/100 VUs, 200 complete and 0 interrupted iterations
v4_race ✓ [ 100% ] 100 VUs  01.4s/30s  200/200 shared iters